{
  "command.extract": "Zip Tools: Extract (unzip) a zip file from the workspace",
  "command.extract.short": "Extract Zip",
  "command.zip": "Zip Tools: Create a zip file from folder",
  "command.zip.short": "Zip Folder",
  "command.openFileWithEditor": "Zip Tools: Open a zip file with a custom editor",
  "command.openFileWithEditor.short": "Open w/ zip editor",
  "extension.description": "An extension which allows for the manipulation of zip (jar, vsix, etc.) files. Now with GZip!",
  "config.zipTypes.description": "An array of file extensions to check files against when unzipping.",
  "config.zipTypes.items.title": "File Extension",
  "config.picky.description": "Whether the extension should automatically fail operations when file extension is not in `zipTypes`. If set to true, extension will only attempt to unzip files with extensions found in `zipTypes`.",
  "config.unzippedSuffix.description": "The suffix to add to folder name when unzipping a zip file. Must not contain any of the following characters: `/ ? % * : | \" < >`.",
  "config.gzipEditorEnabled.description": "When false, stops the GZip editor from automatically decompressing and instead shows a disabled message.",
  "config.deleteOldFileWhenGzipping": "When true, deletes the file you compressed when using `zipViewer.gzip` command.",
  "command.gzip": "Zip Tools: Compress file with GZip compression.",
  "command.gzip.short": "GZip File",
  "config.zipTypes.deprecated": "This setting makes very little sense, so it has been removed.",
  "config.textFileAssociations.description": "A set of paths which identifies the subfiles of a zip file as text files.",
  "config.textFileAssociations.zipPath.description": "The path to the zip file relative to the workspace root.",
  "config.textFileAssociations.subfilePath.description": "The path to the text file relative to the root of the zip file.",
  "config.useLegacyGzipNamingConvention": "If true, swaps old file extension with `gz` instead of adding `.gz` to file name."
}